# num sold estimation by using LinearRegression

# data analysis

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("train.csv")

In [3]:
df.head()

   row_id        date  country       store         product  num_sold
0       0  2015-01-01  Finland  KaggleMart      Kaggle Mug       329
1       1  2015-01-01  Finland  KaggleMart      Kaggle Hat       520
2       2  2015-01-01  Finland  KaggleMart  Kaggle Sticker       146
3       3  2015-01-01  Finland  KaggleRama      Kaggle Mug       572
4       4  2015-01-01  Finland  KaggleRama      Kaggle Hat       911

In [4]:
df1=pd.read_csv("test.csv")

In [5]:
df1.head()

   row_id        date  country       store         product
0   26298  2019-01-01  Finland  KaggleMart      Kaggle Mug
1   26299  2019-01-01  Finland  KaggleMart      Kaggle Hat
2   26300  2019-01-01  Finland  KaggleMart  Kaggle Sticker
3   26301  2019-01-01  Finland  KaggleRama      Kaggle Mug
4   26302  2019-01-01  Finland  KaggleRama      Kaggle Hat

In [6]:
df=df.sample(3000)

In [7]:
def r(x):
    l=[]
    for i in df1[x]:
        if i in df[x]:
            i=df[df[x]==i]["num_sold"].mean()
            l.append(i)
        else:
            i=df["num_sold"].sum()/df["num_sold"].value_counts().sum()
            l.append(i)


    return l

In [8]:
df1["country"]=r("country")

In [9]:
df1["store"]=r("store")

In [10]:
df1["product"]=r("product")

In [11]:
df.shape

(3000, 6)

In [12]:
df.isnull().sum()

row_id      0
date        0
country     0
store       0
product     0
num_sold    0
dtype: int64

In [13]:
df1.isnull().sum()

row_id     0
date       0
country    0
store      0
product    0
dtype: int64

In [14]:
df["country"].nunique()

3

In [15]:
def r(x):
    l=[]
    for i in x:
        i=df[x==i]["num_sold"].mean()
        l.append(i)
        

    return l

In [16]:
df["country"]=r(df["country"])

In [17]:
df["store"]=r(df["store"])

In [18]:
df["product"]=r(df["product"])

In [19]:
df.head()

       row_id        date     country       store     product  num_sold
11409   11409  2016-09-25  348.582700  494.354709  352.628257       392
790       790  2015-02-13  348.582700  494.354709  630.973684       686
19928   19928  2018-01-12  305.853376  276.917498  178.432939       123
14631   14631  2017-03-23  348.582700  494.354709  352.628257       380
16637   16637  2017-07-13  305.853376  494.354709  178.432939       159

In [20]:
df1.head()

   row_id        date     country       store     product
0   26298  2019-01-01  385.418667  385.418667  385.418667
1   26299  2019-01-01  385.418667  385.418667  385.418667
2   26300  2019-01-01  385.418667  385.418667  385.418667
3   26301  2019-01-01  385.418667  385.418667  385.418667
4   26302  2019-01-01  385.418667  385.418667  385.418667

In [21]:
df["date"]=pd.to_datetime(df["date"])

In [22]:
df1["date"]=pd.to_datetime(df1["date"])

In [23]:
import datetime as dt

In [24]:
df["year"]=df["date"].dt.year
df["month"]=df["date"].dt.month
df["day"]=df["date"].dt.day

In [25]:
df1["year"]=df1["date"].dt.year
df1["month"]=df1["date"].dt.month
df1["day"]=df1["date"].dt.day

In [26]:
l=["date","row_id"]

In [27]:
df=df.drop(l,axis=1)

In [28]:
df1=df1.drop(l,axis=1)

In [29]:
df.head()

          country       store     product  num_sold  year  month  day
11409  348.582700  494.354709  352.628257       392  2016      9   25
790    348.582700  494.354709  630.973684       686  2015      2   13
19928  305.853376  276.917498  178.432939       123  2018      1   12
14631  348.582700  494.354709  352.628257       380  2017      3   23
16637  305.853376  494.354709  178.432939       159  2017      7   13

In [30]:
df1.head()

      country       store     product  year  month  day
0  385.418667  385.418667  385.418667  2019      1    1
1  385.418667  385.418667  385.418667  2019      1    1
2  385.418667  385.418667  385.418667  2019      1    1
3  385.418667  385.418667  385.418667  2019      1    1
4  385.418667  385.418667  385.418667  2019      1    1

In [31]:
df=df.reset_index()

In [32]:
df=df.drop("index",axis=1)

In [33]:
x=df.drop("num_sold",axis=1)

In [34]:
y=df[["num_sold"]]

# model training part

In [35]:
from sklearn.linear_model import LinearRegression

In [36]:
from sklearn.model_selection import train_test_split

In [37]:
lr=LinearRegression()

In [38]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=.2,random_state=42)

In [39]:
model1=lr.fit(x_train,y_train)
pred=model1.predict(x_test)

In [40]:
from sklearn.metrics import r2_score

In [41]:
r2_score(pred,y_test)

0.519756403085769

# we estimated by 0.51

In [42]:
model=lr.fit(x,y)

In [43]:
pre=model.predict(df1)

In [44]:
df2=pd.read_csv("test.csv")

In [45]:
df2["num_sold"]=pre

In [46]:
df2=df2[["row_id","num_sold"]]

In [47]:
df2.to_csv("data.csv",index=False)